# список образовательных программ
programs = ["Экономика", "Бизнес-информатика", "Туризм"]
# список дисциплин
subjects = ["Эконометрика", "Базы данных", "Теория игр",
            "Программирование на Python"]
# список олимпиад
olympiads = ["Phystech.International", "Инженерная олимпиада школьников", "Олимпиада Физтех",
             "Отраслевая физико-математическая олимпиада школьников «Росатом»"]
# словарь с описанием дисциплины
subject_dict = {
    "Эконометрика": "наука, изучающая количественные и качественные экономические взаимосвязи с помощью статистических и других математических методов и моделей.",
    "Базы данных": "упорядоченный набор структурированной информации или данных, которые обычно хранятся в электронном виде в компьютерной системе.",
    "Теория игр": " математический метод изучения оптимальных стратегий в играх. ",
    "Программирование на Python": "высокоуровневый язык программирования общего назначения, который используется в том числе и для разработки веб-приложений."
}
# словарь с описанием олимпиады
olympiad_dict = {
    "Phystech.International": "международная олимпиада по физтеху.",
    "Инженерная олимпиада школьников": "олимпиада для школьников, мечтающих стать инженерами.",
    "Олимпиада Физтех": "что-то для физиков-технарей.",
    "Отраслевая физико-математическая олимпиада школьников «Росатом»": "что-то взрывное."
}
